app/Controllers/Assets.php

SELECT COUNT(*) AS `numrows`
FROM `assets`
---
    public function index()
    {
        $perPage = 15;
        $page = (int)($this->request->getGet('page') ?? 1);
        $offset = ($page - 1) * $perPage;

        $assets = $this->assetsModel->getAssetsWithRelations($perPage, $offset);
        $total  = (int)$this->db->table('assets')->countAllResults();