app/Controllers/Assets.php

    public function show($id)
    {
        $asset = $this->assetsModel->findWithRelations($id);
        if (! $asset) {
            return redirect()->to('assets')->with('error', 'Data tidak ditemukan.');
        }

        $procurementsModel = new ProcurementsModel();
        $documentsModel    = new DocumentsModel();
        $employeesModel    = new EmployeesModel();

        // no_rab
        $no_rab = '-';
        if (!empty($asset['procurement_id'])) {
            $proc = $procurementsModel->find($asset['procurement_id']);
---
SELECT *
FROM `procurements`
WHERE `procurements`.`id` = '171'

            }

            // 4) Update asset
            $this->db->table('assets')
                ->where('id', $id)
                ->update([
                    'asset_code'     => $input['asset_code'],
                    'asset_model_id' => $assetModelId,
                    'serial_number'  => $input['serial_number'],
                    'purchase_date'  => $input['purchase_date'] ?? $asset['purchase_date'],
                    'unit_id'        => $unitId,
                    'employee_id'    => $employeeId,
                    'specification'  => $input['specification'] ?? $asset['specification'],
                    'label_attached' => $input['label_attached'] ?? ($asset['label_attached'] ?? 'Belum'),
                    'condition'      => $input['condition'], // sudah required & tervalidasi
                ]);
---
UPDATE `assets` SET `asset_code` = '7312658731', `asset_model_id` = '2', `serial_number` = '732658372', `purchase_date` = '2025-12-31', `unit_id` = '2', `employee_id` = NULL, `specification` = '', `label_attached` = 'Belum', `condition` = 'baik', `updated_at` = '2025-12-24 13:32:38'
WHERE `id` = '2'