app/Controllers/Assets.php

    public function show($id)
{
    $asset = $this->assetsModel->findWithRelations($id);
    if (! $asset) {
        return redirect()->to('assets')->with('error', 'Data tidak ditemukan.');
    }

    $procurementsModel = new ProcurementsModel();
    $documentsModel    = new DocumentsModel();
    $employeesModel    = new EmployeesModel();

    /* ================= PROCUREMENT ================= */
    $no_rab = '-';
    if (!empty($asset['procurement_id'])) {
        $proc = $procurementsModel->find($asset['procurement_id']);
---
SELECT *
FROM `procurements`
WHERE `procurements`.`id` = '1'

    $nipp          = $asset['employee_nipp'] ?? '-';

    if (!empty($asset['employee_id'])) {
        $emp = $employeesModel->find($asset['employee_id']);
---
SELECT *
FROM `employees`
WHERE `employees`.`id` = '1'

    public function delete($id)
    {
        if (! $this->request->is('post')) {
            return redirect()->to('assets')->with('error', 'Metode tidak diizinkan.');
        }

        $asset = $this->assetsModel->find($id);
        if (! $asset) {
            return redirect()->to('assets')->with('error', 'Data tidak ditemukan.');
        }

        try {
            $this->assetsModel->delete($id);
---
SELECT *
FROM `assets`
WHERE `assets`.`id` = '2'
DELETE FROM `assets`
WHERE `id` IN ('2')