app/Controllers/AuthController.php

        ];

        try {
            $insertId = $this->userModel->insert($dataToSave);
---
INSERT INTO `users` (`name`, `email`, `password`, `created_at`, `updated_at`) VALUES ('agung', 'agungreza@gmail.com', '$2y$10$y7xDvuOzbsJ2iG8uBDHlbugIEqc.r52GjDF2oJduxjs3vMgJVmd/W', '2025-11-15 08:51:33', '2025-11-15 08:51:33')

public function processLogin()
{
    if (!$this->request->isAJAX()) {
        return $this->response->setStatusCode(405)->setJSON([
            'status' => 'error',
            'message' => 'Method not allowed'
        ]);
    }

    $email = trim($this->request->getPost('email'));
    $password = $this->request->getPost('password');

    if (empty($email) || empty($password)) {
        return $this->response->setJSON([
            'status' => 'error',
            'message' => 'Email dan password harus diisi'
        ]);
    }

    $user = $this->userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'agungreza@gmail.com'
 LIMIT 1