app/Controllers/BaseController.php

SELECT COUNT(*) AS `numrows`
FROM `assets`
WHERE `condition` = 'rusak'
SELECT COUNT(*) AS `numrows`
FROM `assets`
WHERE `condition` = 'baik'
---
    protected function getStats(): array
    {
        $assetsModel = new AssetsModel();
        $allAssets   = $assetsModel->getAssetsWithRelations();

        $now   = Time::now('Asia/Jakarta');
        $merah = 0;

        foreach ($allAssets as $asset) {

            $baseDate = $asset['purchase_date']
                ?? $asset['procurement_date']
                ?? null;

            if (!$baseDate) continue;

            $tahunKe = ($now->getYear() - date('Y', strtotime($baseDate))) + 1;

            if ($tahunKe >= 4) {
                $merah++;
            }
        }

        // ✅ TOTAL ASLI (BOLEH 0)
        $totalAsli = count($allAssets);

        // ✅ TOTAL UNTUK PEMBAGI (ANTI DIVIDE BY ZERO)
        $totalBagi = max(1, $totalAsli);

        $rusak = $assetsModel->where('condition', 'rusak')->countAllResults();
        $baik  = $assetsModel->where('condition', 'baik')->countAllResults();