app/Models/AssetsModel.php

SELECT `a`.*, `p`.`no_rab`, `p`.`no_npd`, `p`.`procurement_date`, `p`.`notes`, `u`.`name` AS `unit_name`, `am`.`brand`, `am`.`model` AS `model_name`, `e`.`name` AS `employee_name`, `e`.`nipp` AS `employee_nipp`
FROM `assets` `a`
LEFT JOIN `procurements` `p` ON `a`.`procurement_id` = `p`.`id`
LEFT JOIN `units` `u` ON `a`.`unit_id`        = `u`.`id`
LEFT JOIN `asset_models` `am` ON `a`.`asset_model_id` = `am`.`id`
LEFT JOIN `employees` `e` ON `a`.`employee_id`    = `e`.`id`
WHERE `a`.`id` = '2'
---
    public function findWithRelations($id)
    {
        $builder = $this->db->table($this->table . ' a');
        $builder->select('
            a.*,
            p.no_rab,
            p.no_npd,
            p.procurement_date,
            p.notes,
            u.name          AS unit_name,
            am.brand,
            am.model        AS model_name,
            e.name          AS employee_name,
            e.nipp          AS employee_nipp
        ');
        $builder->join('procurements p', 'a.procurement_id = p.id', 'left');
        $builder->join('units u',        'a.unit_id        = u.id', 'left');
        $builder->join('asset_models am','a.asset_model_id = am.id','left');
        $builder->join('employees e',    'a.employee_id    = e.id', 'left');
        $builder->where('a.id', $id);

        return $builder->get()->getRowArray();