app/Models/AssetsModel.php

SELECT `a`.*, `p`.`no_npd`, `p`.`procurement_date`, `u`.`name` as `unit_name`, `am`.`brand`, `am`.`model` as `model_name`, `e`.`name` as `employee_name`
FROM `assets` `a`
LEFT JOIN `procurements` `p` ON `a`.`procurement_id` = `p`.`id`
LEFT JOIN `units` `u` ON `a`.`unit_id` = `u`.`id`
LEFT JOIN `asset_models` `am` ON `a`.`asset_model_id` = `am`.`id`
LEFT JOIN `employees` `e` ON `a`.`employee_id` = `e`.`id`
ORDER BY `a`.`id` DESC
 LIMIT 15
---
    public function getAssetsWithRelations($limit = null, $offset = null)
    {
        $builder = $this->db->table($this->table . ' a');
        $builder->select('a.*, p.no_npd, p.procurement_date, u.name as unit_name, am.brand, am.model as model_name, e.name as employee_name');
        $builder->join('procurements p', 'a.procurement_id = p.id', 'left');
        $builder->join('units u', 'a.unit_id = u.id', 'left');
        $builder->join('asset_models am', 'a.asset_model_id = am.id', 'left');
        $builder->join('employees e', 'a.employee_id = e.id', 'left');
        $builder->orderBy('a.id', 'DESC');
        if ($limit) $builder->limit($limit, $offset);
        return $builder->get()->getResultArray();