app/Models/DocumentsModel.php

SELECT *
FROM `documents`
WHERE `procurement_id` = '2'
AND  `doc_type` LIKE '%BAST%' ESCAPE '!'
ORDER BY `id` DESC
 LIMIT 1
SELECT *
FROM `documents`
WHERE `asset_id` = '2'
AND  `doc_type` LIKE '%BAST%' ESCAPE '!'
ORDER BY `id` DESC
 LIMIT 1
SELECT *
FROM `documents`
WHERE `procurement_id` = '2'
ORDER BY `id` DESC
 LIMIT 1
SELECT *
FROM `documents`
WHERE `asset_id` = '2'
ORDER BY `id` DESC
 LIMIT 1
---
    public function findBastByProcurementOrAsset($procurementId = null, $assetId = null)
    {
        // prioritas: procurement_id
        if (!empty($procurementId)) {
            $q = $this->where('procurement_id', $procurementId)
                      ->like('doc_type', 'BAST', 'both')
                      ->orderBy('id', 'DESC')
                      ->first();
            if ($q) return $q;
        }

        // fallback: cari berdasarkan asset_id
        if (!empty($assetId)) {
            $q = $this->where('asset_id', $assetId)
                      ->like('doc_type', 'BAST', 'both')
                      ->orderBy('id', 'DESC')
                      ->first();
            if ($q) return $q;
        }

        // jika tidak ditemukan dokumen dengan doc_type BAST, coba ambil dokumen apapun terkait procurement_id/asset_id
        if (!empty($procurementId)) {
            $q = $this->where('procurement_id', $procurementId)
                      ->orderBy('id', 'DESC')
                      ->first();
            if ($q) return $q;
        }
        if (!empty($assetId)) {
            $q = $this->where('asset_id', $assetId)
                      ->orderBy('id', 'DESC')
                      ->first();